InformationRegisters/ЗаданияДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияДляПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФактПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураОтметок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/WA_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>WA_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.WA_ТипыНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ПроцедурыДляWA/Ext/Module.bsl
Процедура обОтправитьЗапросВWA(MessageID, DealerID, MessageType, ActionType) Экспорт
	
	//Прокси = WSСсылки.MessageTest.СоздатьWSПрокси("http://wa.dms.webservice/", "Message", "MessageSoap");        	
	Прокси = WSСсылки.Message.СоздатьWSПрокси("http://wa.dms.webservice/", "Message", "MessageSoap");        	
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://wa.dms.webservice/MessageReceiveRequest").Получить("MessageReceiveRequest");
	ТипWSПараметраMessageRecieve = Прокси.ФабрикаXDTO.Пакеты.Получить("http://wa.dms.webservice/MessageReceiveRequest").Получить("MessageReceive");
	ТипWSПараметраTH = Прокси.ФабрикаXDTO.Пакеты.Получить("http://wa.dms.webservice/MessageReceiveRequest").Получить("TransactionHeader");
    		
	TransactionHeader  = Прокси.ФабрикаXDTO.Создать(ТипWSПараметраTH);   
	TransactionHeader.DealerID = DealerID;
	Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
		TransactionHeader.RequestPollingToken = ПараметрыСеанса.Пользователь.Сотрудник.Код;
	Иначе
		TransactionHeader.RequestPollingToken = "";
	КонецЕсли;
	TransactionHeader.TransactionDateTimeUTC = ТекущаяДата();
	TransactionHeader.TransactionDateTimeLocal = ТекущаяДата();
	
	MessageReceive	   = Прокси.ФабрикаXDTO.Создать(ТипWSПараметраMessageRecieve);   
	MessageReceive.MessageID = MessageID;
	MessageReceive.MessageType = MessageType;
	MessageReceive.ActionType = ActionType;

	WSПараметр	   = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);   
	WSПараметр.TransactionHeader = TransactionHeader;
	WSПараметр.MessageReceive = MessageReceive;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();     
	Прокси.ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, WSПараметр, , , , НазначениеТипаXML.Явное);
	СтрокаXML = ЗаписьXML.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(СтрокаXML);
	ТекстДок.УдалитьСтроку(1);
	ТекстДок.УдалитьСтроку(1);
	ТекстДок.УдалитьСтроку(ТекстДок.КоличествоСтрок());
	
    urlAddress = Прокси.ТочкаПодключения.Местоположение;
    hostName=обПолучитьИмяХоста(Прокси.ТочкаПодключения.Местоположение);
    xmlHttp = New COMОбъект("MSXML2.xmlHttp");
    xmlHttp.OPEN ("POST", urlAddress, 0);
    xmlHttp.setRequestHeader ("User-Agent", "1C+Enterprise/8.2");
    xmlHttp.setRequestHeader ("Host", hostName);
    xmlHttp.setRequestHeader ("SOAPAction", "http://wa.dms.webservice/MessageReceive");
    xmlHttp.setRequestHeader ("Content-type", "text/xml; charset=utf-8");
    xmlHttp.setRequestHeader ("Content-Length", "length");
    DOC = Новый COMОбъект("Msxml2.DOMDocument");
    
   	DOC.loadXML("<soap12:Envelope xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xmlns:xsd=""http://www.w3.org/2001/XMLSchema"" xmlns:soap12=""http://www.w3.org/2003/05/soap-envelope"">
   |<soap12:Body>
   |    <MessageReceiveRequest xmlns=""http://wa.dms.webservice/MessageReceiveRequest"">
   |      "+ТекстДок.ПолучитьТекст()+"
   |   </MessageReceiveRequest>
   |</soap12:Body>
   |</soap12:Envelope>");   

    попытка
    	xmlHttp.SEND(DOC);
    исключение
    	Сообщить("Ошибка при отправке "+ОписаниеОшибки());
    конецпопытки;          

    Если xmlHttp.statusText="OK" Тогда       
    	чтениеХМЛ = Новый ЧтениеXML;
		//СтрокаОтвет = СокрЛП(xmlHttp.responseText);
    	чтениеХМЛ.УстановитьСтроку(СокрЛП(xmlHttp.responseText));
    	//хдто = Фабрика.ПрочитатьXML(чтениеХМЛ); 
    КонецЕсли;		    

КонецПроцедуры

Функция обGetCustomer(ПространствоИмен, CustomerData, СправочникСсылка, Тип) Экспорт
	CustomerData.CustomerInfoType = Тип;
	CustomerData.DMSCustomerNo = СправочникСсылка.Код;
	CustomerData.FullName = СправочникСсылка.Наименование;
	CustomerData.CardNo = "";
	CustomerData.CustomerLegalType = ?(СправочникСсылка.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, "1", "2");
	
	Если CustomerData.CustomerLegalType = "1" Тогда
		CustomerData.Email = киПолучитьПредставлениеКИ(СправочникСсылка, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
		CustomerData.FirstName = обПолучитьИмя(СправочникСсылка.Имя);
		CustomerData.MiddleName = обПолучитьОтчество(СправочникСсылка.Отчество);
		CustomerData.LastName = обПолучитьФамилия(СправочникСсылка.Фамилия);
		CustomerData.Gender = ?(СправочникСсылка.Пол = Перечисления.ПолФизическихЛиц.Мужской, "1", "2");
		CustomerData.Salutation = ?(СправочникСсылка.Пол = Перечисления.ПолФизическихЛиц.Мужской, "г-н", "г-жа");
	Иначе
		CustomerData.Email = киПолучитьПредставлениеКИ(СправочникСсылка, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
		CustomerData.FirstName = обПолучитьИмя(СправочникСсылка.Наименование);
		CustomerData.MiddleName = обПолучитьОтчество(СправочникСсылка.Наименование);
		CustomerData.LastName = обПолучитьФамилия(СправочникСсылка.Наименование);
		CustomerData.Gender = "1";
		CustomerData.Salutation = "г-н";
	КонецЕсли;
			
	CustomerAdressesType = ФабрикаXDTO.Тип(ПространствоИмен, "ArrayOfAddress");
	CustomerAdresses = ФабрикаXDTO.Создать(CustomerAdressesType);

	ЗапросАдрес = Новый Запрос();
	ЗапросАдрес.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4,
	               |	КонтактнаяИнформация.Поле5,
	               |	КонтактнаяИнформация.Поле6,
	               |	КонтактнаяИнформация.Поле7,
	               |	КонтактнаяИнформация.Поле8,
	               |	КонтактнаяИнформация.Поле9,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип = &Адрес
	               |	И КонтактнаяИнформация.Объект = &КонтрагентСсылка";
				   
	ЗапросАдрес.Параметры.Вставить("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ЗапросАдрес.Параметры.Вставить("КонтрагентСсылка", СправочникСсылка);
	Выб = ЗапросАдрес.Выполнить().Выбрать();
	НетЮрАдреса = Истина;
	Пока Выб.Следующий() Цикл                          			
		AddressType = ФабрикаXDTO.Тип(ПространствоИмен, "Address");
		AddressData = ФабрикаXDTO.Создать(AddressType);
		Если Выб.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический Тогда
			AddressData.AddressType = "1"; // “1” – адрес по прописке	
			НетЮрАдреса = Ложь;
		ИначеЕсли Выб.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический Тогда
			AddressData.AddressType = "2"; // “2” – фактический адрес
		ИначеЕсли Выб.Вид = Справочники.ВидыКонтактнойИнформации.АдресПочтовый Тогда
			AddressData.AddressType = "3"; // “3” – почтовый адрес
		Иначе
			Продолжить;
		КонецЕсли;          				
		AddressData.FullAddress = Выб.Представление; 
        AddressData.ZipCode = Выб.Поле1;
        AddressData.Region = Выб.Поле2; 
        AddressData.District = Выб.Поле3; 
		AddressData.City = Выб.Поле4; 
		AddressData.Locality = Выб.Поле5; 
		AddressData.Street = Выб.Поле6; 
		AddressData.House = Выб.Поле7; 
        AddressData.Housing = Выб.Поле8; 
		AddressData.Flat = Выб.Поле9;  					            			
		CustomerAdresses.Address.Добавить(AddressData);
	КонецЦикла;
	
	Если CustomerAdresses.Address.Количество() > 0 И НетЮрАдреса Тогда
		AddressType = ФабрикаXDTO.Тип(ПространствоИмен, "Address");
		AddressData = ФабрикаXDTO.Создать(AddressType);
		AddressData.AddressType = "1"; // “1” – адрес по прописке	
		AddressData.FullAddress = CustomerAdresses.Address[0].FullAddress; 
        AddressData.ZipCode = CustomerAdresses.Address[0].ZipCode;
        AddressData.Region = CustomerAdresses.Address[0].Region; 
        AddressData.District = CustomerAdresses.Address[0].District; 
		AddressData.City = CustomerAdresses.Address[0].City; 
		AddressData.Locality = CustomerAdresses.Address[0].Locality; 
		AddressData.Street = CustomerAdresses.Address[0].Street; 
		AddressData.House = CustomerAdresses.Address[0].House; 
        AddressData.Housing = CustomerAdresses.Address[0].Housing; 
		AddressData.Flat = CustomerAdresses.Address[0].Flat;
		CustomerAdresses.Address.Добавить(AddressData);
	КонецЕсли;
	CustomerData.Addresses = CustomerAdresses;		
			
	CustomerContactsType = ФабрикаXDTO.Тип(ПространствоИмен, "ArrayOfContact");
	CustomerContacts = ФабрикаXDTO.Создать(CustomerContactsType);
	
	ЗапросТелефон = Новый Запрос();
	ЗапросТелефон.Параметры.Вставить("КонтрагентСсылка", СправочникСсылка);
	ЗапросТелефон.Параметры.Вставить("Телефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	ЗапросТелефон.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Объект,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип = &Телефон
	               |	И КонтактнаяИнформация.Объект = &КонтрагентСсылка";
				   
	Выб = ЗапросТелефон.Выполнить().Выбрать();
	НетМобильногоТелефона = Истина;
	Пока Выб.Следующий() Цикл                          			
		ContactType = ФабрикаXDTO.Тип(ПространствоИмен, "Contact");
		ContactData = ФабрикаXDTO.Создать(ContactType);
		
		Если Выб.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний Тогда
			ContactData.ContactType = "1"; // “1” – домашний телефон	
		ИначеЕсли Выб.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый И НетМобильногоТелефона Тогда
			ContactData.ContactType = "2"; // “2” – мобильный телефон
			НетМобильногоТелефона = Ложь;
		ИначеЕсли Выб.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный И НетМобильногоТелефона Тогда
			ContactData.ContactType = "2"; // “2” – мобильный телефон
			НетМобильногоТелефона = Ложь;
		ИначеЕсли Выб.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий Тогда
			ContactData.ContactType = "3"; // “3” – рабочий телефон
		Иначе
			Продолжить;
		КонецЕсли;

		ContactData.ContactValue = ПредставлениеТелефонаДляWA(СправочникСсылка, Выб.Вид);
								
		СогласенДо = СправочникСсылка._г_ДатаОкончанияСогласия;
		ContactData.ContactMethodYN = ?(СправочникСсылка.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да И СогласенДо>ТекущаяДата(),"Y","N");
		CustomerContacts.Contact.Добавить(ContactData);
	КонецЦикла;
    CustomerData.Contacts = CustomerContacts;		
			
	SpecialMessageType = ФабрикаXDTO.Тип(ПространствоИмен, "SpecialMessage");
	SpecialMessage = ФабрикаXDTO.Создать(SpecialMessageType);
    SpecialMessage.Message = СправочникСсылка.Комментарий;
    CustomerData.SpecialMessage = SpecialMessage;
	
	CorporateInfosType = ФабрикаXDTO.Тип(ПространствоИмен, "ArrayOfCorporateInfo");
	CorporateInfos = ФабрикаXDTO.Создать(CorporateInfosType);
	
	ЗапросКонтактныеЛица = Новый Запрос; // NEW PHASE 4
	ЗапросКонтактныеЛица.УстановитьПараметр("Ведущий", СправочникСсылка); 
	ЗапросКонтактныеЛица.Текст = "ВЫБРАТЬ
	                             |	Контрагенты.Ссылка КАК Контрагент,
	                             |	Контрагенты.Код,
	                             |	Контрагенты.Наименование
	                             |ИЗ
	                             |	Справочник.Контрагенты КАК Контрагенты
	                             |ГДЕ
	                             |	Контрагенты.ВедушийКонтрагент = &Ведущий
	                             |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	Контрагенты.Ссылка"; 
	
	ЗапросПодтвДокументы = Новый Запрос; // NEW PHASE 4
	ЗапросПодтвДокументы.УстановитьПараметр("Доверенность", Перечисления.ВидыДокументов.Доверенность); 
	ЗапросПодтвДокументы.Текст = "ВЫБРАТЬ
	                             |	ПодтверждающиеДокументы.Номер КАК НомерДоверенности,
	                             |	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи
	                             |ИЗ
	                             |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	                             |ГДЕ
	                             |	ПодтверждающиеДокументы.Владелец = &КонтактноеЛицо
	                             |	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Доверенность
	                             |	И ПодтверждающиеДокументы.Устаревший = ЛОЖЬ
	                             |
	                             |УПОРЯДОЧИТЬ ПО
	                             |	ДатаВыдачи УБЫВ"; 
	
	КонтактныеЛицаКонтрагента = ЗапросКонтактныеЛица.Выполнить().Выбрать(); 
	Пока КонтактныеЛицаКонтрагента.Следующий() Цикл
		CorporateInfoType = ФабрикаXDTO.Тип(ПространствоИмен, "CorporateInfo");
		CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType);
		
		CorporateInfo.CorporateInfoName = "ContactPersonID";
		CorporateInfo.CorporateInfoValue = КонтактныеЛицаКонтрагента.Код;
		CorporateInfos.CorporateInfo.Добавить(CorporateInfo);
		
		CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
		CorporateInfo.CorporateInfoName = "ContactPerson";
		CorporateInfo.CorporateInfoValue = КонтактныеЛицаКонтрагента.Наименование;
		CorporateInfos.CorporateInfo.Добавить(CorporateInfo);
		
		ЗапросТелефон.Параметры.Вставить("КонтрагентСсылка", КонтактныеЛицаКонтрагента.Контрагент);
		Выб = ЗапросТелефон.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл                          							
			CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
			CorporateInfo.CorporateInfoName = "ContactNumber";			
			CorporateInfo.CorporateInfoValue = ПредставлениеТелефонаДляWA(КонтактныеЛицаКонтрагента.Контрагент, Выб.Вид);
			CorporateInfos.CorporateInfo.Добавить(CorporateInfo);
			Если Выб.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;						
		
		ЗапросПодтвДокументы.Параметры.Вставить("КонтактноеЛицо", КонтактныеЛицаКонтрагента.Контрагент);
		Выб = ЗапросПодтвДокументы.Выполнить().Выбрать(); // NEW PHASE 4
		Если Выб.Следующий() Тогда
			CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
			CorporateInfo.CorporateInfoName = "PowerOfAttorney";  
			CorporateInfo.CorporateInfoValue = Выб.НомерДоверенности;
			CorporateInfos.CorporateInfo.Добавить(CorporateInfo);

			CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
			CorporateInfo.CorporateInfoName = "DatePowerOfAttorney";  
			CorporateInfo.CorporateInfoValue = Выб.ДатаВыдачи; 
		Иначе
			CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
			CorporateInfo.CorporateInfoName = "PowerOfAttorney";  
			CorporateInfo.CorporateInfoValue = "";
			CorporateInfos.CorporateInfo.Добавить(CorporateInfo);

			CorporateInfo = ФабрикаXDTO.Создать(CorporateInfoType); 
			CorporateInfo.CorporateInfoName = "DatePowerOfAttorney";  
			CorporateInfo.CorporateInfoValue = ""; 
		КонецЕсли;	
		CorporateInfos.CorporateInfo.Добавить(CorporateInfo);			
	КонецЦикла; 		
	CustomerData.CorporateInfos = CorporateInfos; 

    Возврат CustomerData;
КонецФункции

Функция обGetVehicle(ПространствоИмен, VehicleData, АвтомобильСсылка) Экспорт
	АвтомобильОбъект = АвтомобильСсылка.ПолучитьОбъект();

	VehicleData.DMSVehicleNo = АвтомобильСсылка.Код; 
	VehicleData.VIN = АвтомобильСсылка.VIN; 
	VehicleData.StockNumber = ""; 
	
	ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильСсылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, ТекущаяДата());
	Если обЗначениеНеЗаполнено(ГосНомер) Тогда
		VehicleData.LicensePlateNo = ""; 
	Иначе
		VehicleData.LicensePlateNo = ГосНомер; 	
	КонецЕсли;

	VehicleData.Make = ""; 
	VehicleData.ModelCode = АвтомобильСсылка.Модель.Код; 
	VehicleData.ModelName = АвтомобильСсылка.Модель.Наименование; 
	VehicleData.ModelYear = ?(обЗначениеНеЗаполнено(АвтомобильСсылка.ВариантКомплектации.ГодКомплектации),Формат(АвтомобильСсылка.ГодВыпуска,"ДФ=yyyy"),Формат(АвтомобильСсылка.ВариантКомплектации.ГодКомплектации,"ДФ=YYYY"));    
	
	Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильСсылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	Если обЗначениеНеЗаполнено(Пробег) Тогда
		VehicleData.LastMileage = ""; 
	Иначе
		VehicleData.LastMileage = кмсфпУбратьИзНомераТелефонаВсеБуквы(Строка(Пробег)); 	
	КонецЕсли;

	VehicleData.Color = АвтомобильСсылка.Цвет.ЦветПоГИБДД;
	КлассификацияWA = АвтомобильСсылка.Модель.НаименованиеWA;
	Если ЗначениеЗаполнено(КлассификацияWA) Тогда
		VehicleData.VehicleType = КлассификацияWA;
	Иначе
		VehicleData.VehicleType = "1";
	КонецЕсли;
	ТипДвигателя = АвтомобильСсылка.ВариантКомплектации.ТипДвигателя;
    VehicleData.EngineType = ТипДвигателя.Наименование; 
	VehicleData.EngineCode = ТипДвигателя.Код; 
   	VehicleData.FuelType = ""; 
	VehicleData.Cylinders = ""; 
    VehicleData.Trim = ""; 
	VehicleData.FullModelName = VehicleData.ModelName;
	VehicleData.InsuranceDate = Дата('00010101'); 
    VehicleData.DateInService = Дата('00010101'); 
	VehicleData.DateDelivered = Дата('00010101');
	VehicleData.WarrantyStartDate = АвтомобильСсылка.ДатаНачалаГарантии; 
    VehicleData.WarrantyMonths = ""; 
	VehicleData.WarrantyMiles = ""; 
	VehicleData.LicenseNumber = ""; 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗаказНаряд.Дата
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.Проведен = ИСТИНА
	               |	И ЗаказНаряд.Автомобиль = &Авто
	               |	И ЗаказНаряд.Дата < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказНаряд.Дата УБЫВ";
				   
	Запрос.Параметры.Вставить("Авто", АвтомобильСсылка);
	Запрос.Параметры.Вставить("ТекДата", ТекущаяДата());
	Запрос.Параметры.Вставить("ПустаяСтрока", "");  
	Выб = Запрос.Выполнить().Выбрать();

	Если Выб.Количество()>0 Тогда
		Выб.Следующий();
		LastServiceDate = Выб.Дата;
	Иначе
		LastServiceDate = Дата('00010101');	
	КонецЕсли;
	VehicleData.LastServiceDate = LastServiceDate; 
    VehicleData.ExtendedWarranty = Дата('00010101'); 
	VehicleData.DeclinedJob = "";
	VehicleData.PendingJob = ""; 
    VehicleData.DisplayDescription = АвтомобильСсылка.Наименование; 
	
	CampaignsType = ФабрикаXDTO.Тип(ПространствоИмен, "ArrayOfCampaign");
	Campaigns = ФабрикаXDTO.Создать(CampaignsType);  
	Выб = орПроверитьСервиснуюКампанию(АвтомобильСсылка);          
	Если Выб.Количество() > 0 Тогда
		Для Каждого СтрокаВыб Из Выб Цикл
			Если СтрокаВыб.СервиснаяКампания.Обязательная Тогда
				Продолжить; // NEW PHASE 4
			КонецЕсли; 
			
			CampaignType = ФабрикаXDTO.Тип(ПространствоИмен, "Campaign");
			Campaign = ФабрикаXDTO.Создать(CampaignType);   
			Campaign.CampaignID = СтрокаВыб.СервиснаяКампания.Код;
			Campaign.CampaignDescription = СтрокаВыб.СервиснаяКампания.Наименование;
            Campaign.CampaignPerformed = ?(обЗначениеНеЗаполнено(СтрокаВыб.ДатаВыполнения),"N","Y");
            Campaigns.Campaign.Добавить(Campaign);
		КонецЦикла;
	КонецЕсли; 
	VehicleData.Campaigns = Campaigns;
	VehicleData.ExtendedWarrantyExpireDate = Дата('00010101');
    VehicleData.EngineNo = АвтомобильСсылка.НомерДвигателя; 			
			
    Возврат VehicleData;
КонецФункции
 
Функция обПолучитьВозвратWAError(ПространствоИмен,Источник,ВозвращаемоеЗначение,Код,ТаблицаОшибок,КодОбъекта=Неопределено) Экспорт 
	ResultMessageDataType = ФабрикаXDTO.Тип(ПространствоИмен, "ResultMessage");
	ResultMessageData = ФабрикаXDTO.Создать(ResultMessageDataType); 	
	TransactionHeaderDataType = ФабрикаXDTO.Тип(ПространствоИмен, "TransactionHeader");
	TransactionHeaderData = ФабрикаXDTO.Создать(TransactionHeaderDataType);
	TransactionHeaderData = Источник.TransactionHeader;      
	ResultMessageData.Code = Код;
	Если Код = "-1" Тогда
		ResultMessageData.Message = "fail"; 
	ИначеЕсли Код = "0" Тогда
    	ResultMessageData.Message = "No data found"; 
	Иначе
    	ResultMessageData.Message = ?(КодОбъекта=Неопределено,"Success",КодОбъекта);	
	КонецЕсли;	
	Если Код = "-1" Тогда
		ArrayOfErrorDataType = ФабрикаXDTO.Тип(ПространствоИмен, "ArrayOfError");
		ArrayOfErrorData = ФабрикаXDTO.Создать(ArrayOfErrorDataType);
		Для Каждого Строка Из ТаблицаОшибок Цикл
			ErrorDataType = ФабрикаXDTO.Тип(ПространствоИмен, "Error");
			ErrorData = ФабрикаXDTO.Создать(ErrorDataType); 			
			ErrorData.Code = Строка.Код;
			ErrorData.Message = Строка.ТекстОшибки;     		
			ArrayOfErrorData.Error.Добавить(ErrorData);  
		КонецЦикла;
		ВозвращаемоеЗначение.Errors = ArrayOfErrorData; 
	КонецЕсли;
	ВозвращаемоеЗначение.ResultMessage = ResultMessageData;  	
	ВозвращаемоеЗначение.TransactionHeader = TransactionHeaderData;  
	Возврат ВозвращаемоеЗначение;
КонецФункции

Функция обПолучитьОтметкиПоЗаказНаряду(ЗаказНаряд) Экспорт
	Если ЗначениеЗаполнено(ЗаказНаряд.ДокументОснование) Тогда
		СтрокаУсловие = "ЗаявкаНаРемонт = &ДокСсылка";   
	Иначе
		СтрокаУсловие = "ЗаказНаряд = &ДокСсылка";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезультатыКруговогоОсмотра.ЗвуковойСигнал,
	               |	РезультатыКруговогоОсмотра.СтояночныйТормоз,
	               |	РезультатыКруговогоОсмотра.РемниБезопасности,
	               |	РезультатыКруговогоОсмотра.ОтопительКондиционер,
	               |	РезультатыКруговогоОсмотра.СтеклоочистителиОмыватели,
	               |	РезультатыКруговогоОсмотра.УровеньТоплива,
	               |	РезультатыКруговогоОсмотра.ВнешниеОсветительныеПриборы,
	               |	РезультатыКруговогоОсмотра.ВоздушныйФильтрДвигателя,
	               |	РезультатыКруговогоОсмотра.УровеньМаслаВДвигателе,
	               |	РезультатыКруговогоОсмотра.ПриводныеРемни,
	               |	РезультатыКруговогоОсмотра.Трубопроводы,
	               |	РезультатыКруговогоОсмотра.КлеммыАКБ,
	               |	РезультатыКруговогоОсмотра.РулевоеУправление,
	               |	РезультатыКруговогоОсмотра.ПодшипникиСтупицПередних,
	               |	РезультатыКруговогоОсмотра.ПодшипникиСтупицЗадних,
	               |	РезультатыКруговогоОсмотра.Амортизаторы,
	               |	РезультатыКруговогоОсмотра.ТормозныеДискиПередние,
	               |	РезультатыКруговогоОсмотра.ТормозныеДискиЗадние,
	               |	РезультатыКруговогоОсмотра.ТормозныеКолодкиПередние,
	               |	РезультатыКруговогоОсмотра.ТормозныеКолодкиЗадние,
	               |	РезультатыКруговогоОсмотра.КолесныеДискиКолпакиШины,
	               |	РезультатыКруговогоОсмотра.СостояниеСотРадиатора,
	               |	РезультатыКруговогоОсмотра.ШРУСыИПыльники,
	               |	РезультатыКруговогоОсмотра.ПередняяПодвеска,
	               |	РезультатыКруговогоОсмотра.ЗадняяПодвеска,
	               |	РезультатыКруговогоОсмотра.СистемаВыпуска,
	               |	РезультатыКруговогоОсмотра.ГерметичностьОтстутствиеПодтеканий,
	               |	РезультатыКруговогоОсмотра.ЗапасноеКолесо,
	               |	РезультатыКруговогоОсмотра.ШтатныйНаборИнструментов,
	               |	РезультатыКруговогоОсмотра.Домкрат,
	               |	РезультатыКруговогоОсмотра.ДорожныйНабор,
	               |	РезультатыКруговогоОсмотра.Аптечка,
	               |	РезультатыКруговогоОсмотра.Пепельница,
	               |	РезультатыКруговогоОсмотра.Прикуриватель,
	               |	РезультатыКруговогоОсмотра.ОхранныеСистемыСБлокировкойЗапускаДвигателя,
	               |	РезультатыКруговогоОсмотра.СекретныеГайкиНаКолесах,
				   |	РезультатыКруговогоОсмотра.КлючЗаявки,
	               |	РезультатыКруговогоОсмотра.Кузов
	               |ИЗ
	               |	РегистрСведений.РезультатыКруговогоОсмотра КАК РезультатыКруговогоОсмотра
	               |ГДЕ
	               |	РезультатыКруговогоОсмотра."+СтрокаУсловие;
				   
	Запрос.Параметры.Вставить("ДокСсылка",?(ЗначениеЗаполнено(ЗаказНаряд.ДокументОснование),ЗаказНаряд.ДокументОснование,ЗаказНаряд));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество()=0 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		СтруктураОтметок = Новый Структура;
		Если Выборка.СтояночныйТормоз Тогда СтруктураОтметок.Вставить("И21","V"); Иначе СтруктураОтметок.Вставить("НИ21","V"); КонецЕсли;
        Если Выборка.РемниБезопасности Тогда СтруктураОтметок.Вставить("И22","V"); Иначе СтруктураОтметок.Вставить("НИ22","V"); КонецЕсли;
		Если Выборка.ЗвуковойСигнал Тогда СтруктураОтметок.Вставить("И23","V"); Иначе СтруктураОтметок.Вставить("НИ23","V"); КонецЕсли;
		Если Выборка.ОтопительКондиционер Тогда СтруктураОтметок.Вставить("И24","V"); Иначе СтруктураОтметок.Вставить("НИ24","V"); КонецЕсли;
		Если Выборка.СтеклоочистителиОмыватели Тогда СтруктураОтметок.Вставить("И25","V"); Иначе СтруктураОтметок.Вставить("НИ25","V"); КонецЕсли;
		
		СтруктураОтметок.Вставить("УровеньТоплива",Строка(Выборка.УровеньТоплива));
				
		Если Выборка.ВнешниеОсветительныеПриборы Тогда СтруктураОтметок.Вставить("И41","V"); Иначе СтруктураОтметок.Вставить("НИ41","V"); КонецЕсли;
		
		Если Выборка.ВоздушныйФильтрДвигателя Тогда СтруктураОтметок.Вставить("И51","V"); Иначе СтруктураОтметок.Вставить("НИ51","V"); КонецЕсли;
		СтруктураОтметок.Вставить("УровеньМасла",Строка(Выборка.УровеньМаслаВДвигателе));
		Если Выборка.ПриводныеРемни Тогда СтруктураОтметок.Вставить("И53","V"); Иначе СтруктураОтметок.Вставить("НИ53","V"); КонецЕсли;
		Если Выборка.Трубопроводы Тогда СтруктураОтметок.Вставить("И54","V"); Иначе СтруктураОтметок.Вставить("НИ54","V"); КонецЕсли;
		Если Выборка.КлеммыАКБ Тогда СтруктураОтметок.Вставить("И55","V"); Иначе СтруктураОтметок.Вставить("НИ55","V"); КонецЕсли;
		
		Если Выборка.РулевоеУправление Тогда СтруктураОтметок.Вставить("И61","V"); Иначе СтруктураОтметок.Вставить("НИ61","V"); КонецЕсли;
        Если Выборка.ПодшипникиСтупицПередних Тогда СтруктураОтметок.Вставить("И62","V"); Иначе СтруктураОтметок.Вставить("НИ62","V"); КонецЕсли;
		Если Выборка.ПодшипникиСтупицЗадних Тогда СтруктураОтметок.Вставить("И63","V"); Иначе СтруктураОтметок.Вставить("НИ63","V"); КонецЕсли;
		Если Выборка.Амортизаторы Тогда СтруктураОтметок.Вставить("И64","V"); Иначе СтруктураОтметок.Вставить("НИ64","V"); КонецЕсли;
		Если Выборка.ТормозныеДискиПередние Тогда СтруктураОтметок.Вставить("И65","V"); Иначе СтруктураОтметок.Вставить("НИ65","V"); КонецЕсли;
		Если Выборка.ТормозныеДискиЗадние Тогда СтруктураОтметок.Вставить("И66","V"); Иначе СтруктураОтметок.Вставить("НИ66","V"); КонецЕсли;
        Если Выборка.ТормозныеКолодкиПередние Тогда СтруктураОтметок.Вставить("И67","V"); Иначе СтруктураОтметок.Вставить("НИ67","V"); КонецЕсли;
		Если Выборка.ТормозныеКолодкиЗадние Тогда СтруктураОтметок.Вставить("И68","V"); Иначе СтруктураОтметок.Вставить("НИ68","V"); КонецЕсли;
		Если Выборка.КолесныеДискиКолпакиШины Тогда СтруктураОтметок.Вставить("И69","V"); Иначе СтруктураОтметок.Вставить("НИ69","V"); КонецЕсли;
		Если Выборка.СостояниеСотРадиатора Тогда СтруктураОтметок.Вставить("И60","V"); Иначе СтруктураОтметок.Вставить("НИ60","V"); КонецЕсли;

        Если Выборка.ШРУСыИПыльники Тогда СтруктураОтметок.Вставить("И71","V"); Иначе СтруктураОтметок.Вставить("НИ71","V"); КонецЕсли;
        Если Выборка.ПередняяПодвеска Тогда СтруктураОтметок.Вставить("И72","V"); Иначе СтруктураОтметок.Вставить("НИ72","V"); КонецЕсли;
		Если Выборка.ЗадняяПодвеска Тогда СтруктураОтметок.Вставить("И73","V"); Иначе СтруктураОтметок.Вставить("НИ73","V"); КонецЕсли;
		Если Выборка.СистемаВыпуска Тогда СтруктураОтметок.Вставить("И74","V"); Иначе СтруктураОтметок.Вставить("НИ74","V"); КонецЕсли;
		Если Выборка.ГерметичностьОтстутствиеПодтеканий Тогда СтруктураОтметок.Вставить("И75","V"); Иначе СтруктураОтметок.Вставить("НИ75","V"); КонецЕсли;
		
		СтруктураОтметок.Вставить("ОсмотрСнаружи","\\192.168.32.6\Upload\VHCBody\RC271\"+Формат(ЗаказНаряд.ДатаНачала,"ДФ=yyyyMMdd")+"\VHCBody_"+Выборка.КлючЗаявки+".jpg");

		Если Выборка.ЗапасноеКолесо Тогда СтруктураОтметок.Вставить("Е91","V"); Иначе СтруктураОтметок.Вставить("Н91","V"); КонецЕсли;
        Если Выборка.ШтатныйНаборИнструментов Тогда СтруктураОтметок.Вставить("Е92","V"); Иначе СтруктураОтметок.Вставить("Н92","V"); КонецЕсли;
		Если Выборка.Домкрат Тогда СтруктураОтметок.Вставить("Е93","V"); Иначе СтруктураОтметок.Вставить("Н93","V"); КонецЕсли;
		Если Выборка.ДорожныйНабор Тогда СтруктураОтметок.Вставить("Е94","V"); Иначе СтруктураОтметок.Вставить("Н94","V"); КонецЕсли;
		Если Выборка.Аптечка Тогда СтруктураОтметок.Вставить("Е95","V"); Иначе СтруктураОтметок.Вставить("Н95","V"); КонецЕсли;
        Если Выборка.Пепельница Тогда СтруктураОтметок.Вставить("Е96","V"); Иначе СтруктураОтметок.Вставить("Н96","V"); КонецЕсли;
        Если Выборка.Прикуриватель Тогда СтруктураОтметок.Вставить("Е97","V"); Иначе СтруктураОтметок.Вставить("Н97","V"); КонецЕсли;
		Если Выборка.ОхранныеСистемыСБлокировкойЗапускаДвигателя Тогда СтруктураОтметок.Вставить("Е101","V"); Иначе СтруктураОтметок.Вставить("Н101","V"); КонецЕсли;
		Если Выборка.СекретныеГайкиНаКолесах Тогда СтруктураОтметок.Вставить("Е102","V"); Иначе СтруктураОтметок.Вставить("Н102","V"); КонецЕсли;

		Возврат СтруктураОтметок;
	КонецЕсли;
КонецФункции

Процедура фзОчиститьРегистрЗаданийНаПечать() Экспорт
	//СписокУдаляемых = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияДляПечати.Объект,
	               |	ЗаданияДляПечати.ПечатнаяФорма
	               |ИЗ
	               |	РегистрСведений.ЗаданияДляПечати КАК ЗаданияДляПечати
	               |ГДЕ
	               |	ЗаданияДляПечати.ФактПечати = ИСТИНА";
				   
	//Запрос.Параметры.Вставить("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
		НаборЗаписей = РегистрыСведений.ЗаданияДляПечати.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект); 
		НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры  

// Блок функции для привязки фотографий и результатов кругового осмотра к заказ-нарядам
Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON) Экспорт 
     
    Результат = Новый Структура;
    
    ТекстJSON = СтрЗаменить(ТекстJSON, "\""", """");    // заменим последовательность \" на "

    ТекстJSON = СтрЗаменить(ТекстJSON, """", "");        // а теперь удалим все кавычки

    
    Если Лев(ТекстJSON, 1) = "{" Тогда
        // начало структуры

        ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, "Структура");
        
    ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
        // начало массива

        МассивДанных = Новый Массив;
        ЗаполнитьДанныеИзОтветаJSON(МассивДанных, ТекстJSON, "Массив");
        
        Результат.Вставить("Значение", МассивДанных);
        
    КонецЕсли;
        
    Возврат Результат;
    
КонецФункции

Процедура ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, ТипДанных)
    
    ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));    // удалим открывающий символ структуры(массива)

    
    НомерЗначения = 0;
    
    Пока ТекстJSON <> "" Цикл
        
        ПервыйСимвол = Лев(ТекстJSON, 1);
        Если ПервыйСимвол = "{" Тогда
            // вложенная структура

            Значение = Новый Структура;
            ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
            
            Если ТипДанных = "Структура" Тогда
                Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
                НомерЗначения = НомерЗначения + 1;
            ИначеЕсли ТипДанных = "Массив" Тогда
                Результат.Добавить(Значение);
            КонецЕсли;
        
        ИначеЕсли ПервыйСимвол = "[" Тогда
            // вложенный массив

            Значение = Новый Массив;
            ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
            
            Если ТипДанных = "Структура" Тогда
                Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
                НомерЗначения = НомерЗначения + 1;
            Иначе
                Результат.Добавить(Значение);
            КонецЕсли;
            
        ИначеЕсли ПервыйСимвол = "}" И ТипДанных = "Структура" Тогда
            // структура закончилась

            ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            Если Лев(ТекстJSON, 1) = "," Тогда
                ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            КонецЕсли;
            
            Возврат;
            
        ИначеЕсли ПервыйСимвол = "]" И ТипДанных = "Массив" Тогда
            // массив закончился

            ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            Если Лев(ТекстJSON, 1) = "," Тогда
                ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            КонецЕсли;
            
            Возврат;
            
        Иначе
            
            Если ТипДанных = "Структура" Тогда
                
                Поз = Найти(ТекстJSON, ":");
                Если Поз = 0 Тогда
                    // неверный формат, прервемся

                    Прервать;
                КонецЕсли;                 
       
                ИмяЗначения = СокрЛП(Лев(ТекстJSON, Поз - 1));
                ИмяЗначения = СтрЗаменить(ИмяЗначения, """", "");
                
                ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз+1));
                                
                Если Лев(ТекстJSON, 1) = "{" Тогда
                    // значение является структурой

                    Значение = Новый Структура;
                    ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
                    
                ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
                    // значение является массивом

                    Значение = Новый Массив;
                    ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
                    
                Иначе
                    // обычное значение

                    ПервыйКавычка = Ложь;
                    ПредпоследнийКавычка = Ложь;
                    Поз = 0;
                    Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
                        Символ = Сред(ТекстJSON, Сч, 1);
                        
                        Если Символ = """" Тогда
                            Если ПервыйКавычка Тогда
                                ПредпоследнийКавычка = Истина;
                            Иначе
                                ПервыйКавычка = Истина;
                            КонецЕсли;                            
                        КонецЕсли;
                        
                        Если (Символ = "," И ((ПервыйКавычка И ПредпоследнийКавычка) Или (Не ПервыйКавычка И Не ПредпоследнийКавычка))) ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
                            Поз = Сч;
                            Прервать;
                        КонецЕсли;
                    КонецЦикла;
                    
                    
                    Если Поз = 0 Тогда
                        Значение = ТекстJSON;
                        ТекстJSON = "";
                        
                    Иначе
                        Значение = Лев(ТекстJSON, Поз - 1);
                        Значение = СтрЗаменить(Значение, """", "");
                        ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));                        
                    КонецЕсли;
                    
                    Значение = СокрЛП(Значение);
                    
                КонецЕсли;
                
                Результат.Вставить(ИмяЗначения, Значение);
                
            ИначеЕсли ТипДанных = "Массив" Тогда
                
                // обычное значение

                Поз = 0;
                Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
                    Символ = Сред(ТекстJSON, Сч, 1);
                    Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
                        Поз = Сч;
                        Прервать;
                    КонецЕсли;
                КонецЦикла;
                
                //ПредпоследнийКавычка = Ложь;

                //Если Сред(ТекстJSON, Поз - 1, 1) = """" Тогда

                //    ПредпоследнийКавычка = Истина;

                //КонецЕсли;

                
                Если Поз = 0 Тогда
                    Значение = ТекстJSON;
                    ТекстJSON = "";
                    
                Иначе
                    Значение = Лев(ТекстJSON, Поз - 1);
                    Значение = СтрЗаменить(Значение, """", "");
                    ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
                    
                КонецЕсли;
                
                Значение = СокрЛП(Значение);
                
                Результат.Добавить(Значение);
                
            КонецЕсли;
                
            
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Функция КодСимволаFromURL(Символ) 
	Если Символ="%7B" Тогда 
		Возврат "{"; 
	ИначеЕсли Символ="%7D" Тогда          
		Возврат "}";   
	ИначеЕсли Символ="%22" Тогда 
	   Возврат Символ(34);               
	ИначеЕсли Символ="%3A" Тогда                 
		Возврат ":"; 
	ИначеЕсли Символ="%2C" Тогда         
		Возврат ","; 
	ИначеЕсли Символ="%5B" Тогда                    
		Возврат "["; 
	ИначеЕсли Символ="%5D" Тогда         
		Возврат "]"; 
	Иначе 
		Возврат "-"; 
	КонецЕсли; 
КонецФункции

Функция URLDecode(value) 
     
    result = "";        
            
    length = СтрДлина( value );        
    
	Для i = 1 По  length Цикл  
		Если Сред(value, i, 1)="%" Тогда
	        symbol = Сред( value, i, 3 );        
	        code = КодСимволаFromURL( symbol );
	        result = result + code;  
			i=i+2;
		Иначе
			result = result + Сред(value, i, 1);
		КонецЕсли;
    КонецЦикла;       
    
    Возврат result;
КонецФункции

Функция ДеталиНеисправности(Узел,НаимУзла,ЗаказНаряд)
	Если Узел.Свойство("photo")=False Тогда Возврат Ложь; КонецЕсли;
	Если Узел.photo="null" Тогда Возврат Ложь; КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КартинкиИФайлы.ИмяФайла,
	               |	КартинкиИФайлы.Идентификатор
	               |ИЗ
	               |	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	               |ГДЕ
	               |	КартинкиИФайлы.Объект = &ЗаказНаряд
	               |	И КартинкиИФайлы.Идентификатор ПОДОБНО &Узел
	               |	И КартинкиИФайлы.ДатаСохранения < &ТекДата";
				   
	Запрос.Параметры.Вставить("ЗаказНаряд", ЗаказНаряд);
	Запрос.Параметры.Вставить("Узел", "%"+НаимУзла+"%");
	Запрос.Параметры.Вставить("ТекДата", НачалоДня(ТекущаяДата()));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=0 Тогда к=1; ИначеЕсли Выборка.Количество()>10 Тогда к=20; Иначе к=10; КонецЕсли;  
	Для Каждого ЭлМассива Из Узел.photo Цикл
		РегКартинкиИФайлы = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		РегКартинкиИФайлы.Объект = ЗаказНаряд;
		РегКартинкиИФайлы.Идентификатор = НаимУзла+Строка(к);
		РегКартинкиИФайлы.ИмяФайла = "\\192.168.32.6\Upload\VehicleHealthCheck\RC271\"+ЭлМассива;
		РегКартинкиИФайлы.ДатаСохранения = ТекущаяДата();
		РегКартинкиИФайлы.Комментарий = "Фотографии из планшета WA";
		РегКартинкиИФайлы.ДанныеВоВнешнемФайле = Истина;
		РегКартинкиИФайлы.Картинка = Истина;
		РегКартинкиИФайлы.Записать(Истина);
		к=к+1;
	КонецЦикла;
	Возврат Ложь;
КонецФункции                                                       

Процедура ЗанестиРезультатыКруговогоОсмотра() Экспорт

	//Подключение к SQL
	ServerName = "SERVERWA";
	DataBaseName = "WACore_Main";
	LoginName = "wacore";
	LoginPassword = "wacore!";
	
	СоединениеSQL = Новый COMОбъект("ADODB.Connection");
	СоединениеSQL.CommandTimeOut=0;
	СоединениеSQL.CursorLocation=3;

	СтрокаСоединения = ""+
		"Provider=SQLOLEDB.1;"+
		"Password="+LoginPassword+";"+
		"Persist Security Info=True;"+
		"User ID="+LoginName+";"+
		"Initial Catalog="+DataBaseName+";"+
		"Data Source="+ServerName+"";      
	
	Попытка
		СоединениеSQL.Open(СтрокаСоединения);
	Исключение
		Сообщить("Подключиться к SQL серверу не удалось. База: "+DataBaseName, СтатусСообщения.Важное);
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		//Сообщить("Текст запроса: "+ТекстЗапроса);
		ЗапросВыполнен = Ложь;        
	КонецПопытки;

	Если СоединениеSQL.State = 0 Тогда
		Connection=Неопределено
	Иначе
		Connection=СоединениеSQL;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	               |	ЗаявкаНаРемонт.Ссылка КАК ЗаявкаНаРемонт,
	               |	ЗаявкаНаРемонт.ВидРемонта КАК ВидРемонта,
	               |	ЗаявкаНаРемонт.ПричинаОбращения КАК ПричинаОбращения,
	               |	ЗаказНаряд.Номер
	               |ИЗ
	               |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
	               |		ПО ЗаявкаНаРемонт.Ссылка = ЗаказНаряд.ДокументОснование
	               |ГДЕ
	               |	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ЗаказНаряд.ВидРемонта.SendWA = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаказНаряд.Ссылка,
	               |	ЗНАЧЕНИЕ(Документ.ЗаявкаНаРемонт.ПустаяСсылка),
	               |	ЗаказНаряд.ВидРемонта,
	               |	ЗаказНаряд.ПричинаОбращения,
	               |	ЗаказНаряд.Номер
	               |ИЗ
	               |	Документ.ЗаказНаряд КАК ЗаказНаряд
	               |ГДЕ
	               |	ЗаказНаряд.ДокументОснование = НЕОПРЕДЕЛЕНО
	               |	И ЗаказНаряд.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ЗаказНаряд.ВидРемонта.SendWA = ИСТИНА";
				   
	Запрос.Параметры.Вставить("ДатаНач",НачалоДня(ТекущаяДата()));
	Запрос.Параметры.Вставить("ДатаКон",КонецДня(ТекущаяДата()));
    Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		ТекстЗапроса = "
		|SELECT
		|	 v.AppointmentSeq,
	    |    v.VHCTotalValue as TotalValue,
		|	 v.VHCTotalValue_NotOK,
		|	 v.UserIdCreated 
		|	 FROM [WACore_Main].[dbo].[TB_MAIN_RepairOrder] as r
		|	 LEFT OUTER JOIN [WACore_Main].[dbo].[TB_MAIN_VHC] as v on (r.AppointmentGUID=v.AppointmentGUID)
		|	 WHERE r.DMS_RepairOrderNo=N'"+Выборка.Номер+"'"; 

		
		// Создаем com объект, будет содержать результат запроса
		RecordSet =  Новый ComОбъект("ADODB.RecordSet");
		ЗапросВыполнен = Истина;
		Попытка 		
			RecordSet.Open(СокрЛП(ТекстЗапроса), Connection, 1, 3);
		Исключение
			Сообщить("Подключиться к SQL серверу не удалось. База: "+DataBaseName, СтатусСообщения.Важное);
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
			Сообщить("Текст запроса: "+ТекстЗапроса);
			ЗапросВыполнен = Ложь;
		КонецПопытки;
		
		Если ЗапросВыполнен Тогда
			Пока НЕ RecordSet.EOF Цикл
				                               
				VHCTotalValue = Base64Значение(RecordSet.Fields(1).Value);
				//VHCTotalValue_NOT_OK = Base64Значение(RecordSet.Fields(2).Value);
				VHCTotalValue.Записать(КаталогВременныхФайлов()+RecordSet.Fields(0).Value+"_OK.txt");
				//VHCTotalValue_NOT_OK.Записать(КаталогВременныхФайлов()+RecordSet.Fields(0).Value+"_NOT_OK.txt");       
				
				тк = Новый ТекстовыйДокумент;			
				тк.Прочитать(КаталогВременныхФайлов()+RecordSet.Fields(0).Value+"_OK.txt",КодировкаТекста.ANSI);
				URLText = тк.ПолучитьТекст();

			    JSONtext = URLDecode(URLText);			
				Результат = ЗаполнитьСтруктуруИзОтветаJSON(JSONtext);
				
				Если Результат.Свойство("sa") = Истина Тогда

					ЗаписьКруговогоОсмотра = РегистрыСведений.РезультатыКруговогоОсмотра.СоздатьМенеджерЗаписи();
					ЗаявкаНаРемонт = Выборка.ЗаявкаНаРемонт;
					ЗаказНаряд = Выборка.ЗаказНаряд;				
					ЗаписьКруговогоОсмотра.ЗаявкаНаРемонт = ЗаявкаНаРемонт;
					ЗаписьКруговогоОсмотра.ЗаказНаряд = ЗаказНаряд;
					//ЗаписьКруговогоОсмотра.Раздел = "Внутри/Внешний";  
					ЗаписьКруговогоОсмотра.ЗвуковойСигнал = ?(Результат.sa.interior.horn.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.horn,"ЗвуковойСигнал",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.СтояночныйТормоз = ?(Результат.sa.interior.parkingBrake.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.parkingBrake,"СтояночныйТормоз",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.РемниБезопасности = ?(Результат.sa.interior.safetyBelts.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.safetyBelts,"РемниБезопасности",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ОтопительКондиционер = ?(Результат.sa.interior.conditionSystem.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.conditionSystem,"ОтопительКондиционер",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.СтеклоочистителиОмыватели = ?(Результат.sa.interior.wipersWashers.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.wipersWashers,"СтеклоочистителиОмыватели",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.УровеньТоплива = Результат.sa.interior.fuellevelcheck.v;
					ЗаписьКруговогоОсмотра.ВнешниеОсветительныеПриборы = ?(Результат.sa.interior.externalLights.v="g",Истина,ДеталиНеисправности(Результат.sa.interior.externalLights,"ВнешниеОсветительныеПриборы",ЗаказНаряд));

					ЗаписьКруговогоОсмотра.ВоздушныйФильтрДвигателя = ?(Результат.sa.underhood.airFilter.v="g",Истина,ДеталиНеисправности(Результат.sa.underhood.airFilter,"ВоздушныйФильтрДвигателя",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.УровеньМаслаВДвигателе = Результат.sa.underhood.OilLevel.v;
					ЗаписьКруговогоОсмотра.ПриводныеРемни = ?(Результат.sa.underhood.driveBelts.v="g",Истина,ДеталиНеисправности(Результат.sa.underhood.driveBelts,"ПриводныеРемни",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.Трубопроводы = ?(Результат.sa.underhood.pipelinesLeakage.v="g",Истина,ДеталиНеисправности(Результат.sa.underhood.pipelinesLeakage,"Трубопроводы",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.КлеммыАКБ = ?(Результат.sa.underhood.battery.v="g",Истина,ДеталиНеисправности(Результат.sa.underhood.battery,"КлеммыАКБ",ЗаказНаряд));
					
					ЗаписьКруговогоОсмотра.РулевоеУправление = ?(Результат.sa.partlylifted.steeringSystem.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.steeringSystem,"РулевоеУправление",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ПодшипникиСтупицПередних = ?(Результат.sa.partlylifted.frontWheelBearings.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.frontWheelBearings,"ПодшипникиСтупицПередних",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ПодшипникиСтупицЗадних = ?(Результат.sa.partlylifted.rearWheelBearings.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.rearWheelBearings,"ПодшипникиСтупицЗадних",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.Амортизаторы = ?(Результат.sa.partlylifted.shockAbsorbers.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.shockAbsorbers,"Амортизаторы",ЗаказНаряд));
                    ЗаписьКруговогоОсмотра.ТормозныеДискиПередние = ?(Результат.sa.partlylifted.frontBrakeDiscs.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.frontBrakeDiscs,"ТормозныеДискиПередние",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ТормозныеДискиЗадние = ?(Результат.sa.partlylifted.rearBrakeDiscs.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.rearBrakeDiscs,"ТормозныеДискиЗадние",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ТормозныеКолодкиПередние = ?(Результат.sa.partlylifted.frontBrakePads.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.frontBrakePads,"ТормозныеКолодкиПередние",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ТормозныеКолодкиЗадние = ?(Результат.sa.partlylifted.rearBrakePads.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.rearBrakePads,"ТормозныеКолодкиЗадние",ЗаказНаряд));
                    ЗаписьКруговогоОсмотра.КолесныеДискиКолпакиШины = ?(Результат.sa.partlylifted.tyresWheelDiscs.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.tyresWheelDiscs,"КолесныеДискиКолпакиШины",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.СостояниеСотРадиатора = ?(Результат.sa.partlylifted.radiators.v="g",Истина,ДеталиНеисправности(Результат.sa.partlylifted.radiators,"СостояниеСотРадиатора",ЗаказНаряд));
					
					ЗаписьКруговогоОсмотра.ШРУСыИПыльники = ?(Результат.sa.fullylifted.driveShafts.v="g",Истина,ДеталиНеисправности(Результат.sa.fullylifted.driveShafts,"ШРУСыИПыльники",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ПередняяПодвеска = ?(Результат.sa.fullylifted.frontSuspension.v="g",Истина,ДеталиНеисправности(Результат.sa.fullylifted.frontSuspension,"ПередняяПодвеска",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ЗадняяПодвеска = ?(Результат.sa.fullylifted.rearSuspension.v="g",Истина,ДеталиНеисправности(Результат.sa.fullylifted.rearSuspension,"ЗадняяПодвеска",ЗаказНаряд));
                    ЗаписьКруговогоОсмотра.СистемаВыпуска = ?(Результат.sa.fullylifted.exhaustSystem.v="g",Истина,ДеталиНеисправности(Результат.sa.fullylifted.exhaustSystem,"СистемаВыпуска",ЗаказНаряд));
					ЗаписьКруговогоОсмотра.ГерметичностьОтстутствиеПодтеканий = ?(Результат.sa.fullylifted.technicalLiquids.v="g",Истина,ДеталиНеисправности(Результат.sa.fullylifted.technicalLiquids,"ГерметичностьОтстутствиеПодтеканий",ЗаказНаряд));
					
					Попытка ЗаписьКруговогоОсмотра.ЗапасноеКолесо = ?(Результат.sa.additional.ruadditionalwheel.v="g",Истина,Ложь); Исключение КонецПопытки;
					Попытка ЗаписьКруговогоОсмотра.ШтатныйНаборИнструментов = ?(Результат.sa.additional.rustandardtool.v="g",Истина,Ложь); Исключение КонецПопытки;
                    Попытка ЗаписьКруговогоОсмотра.Домкрат = ?(Результат.sa.additional.rujack.v="g",Истина,Ложь); Исключение КонецПопытки;
                    Попытка ЗаписьКруговогоОсмотра.ДорожныйНабор = ?(Результат.sa.additional.ruaddkit.v="g",Истина,Ложь); Исключение КонецПопытки;
					Попытка ЗаписьКруговогоОсмотра.Аптечка = ?(Результат.sa.additional.rufirstaidkit.v="g",Истина,Ложь); Исключение КонецПопытки;
					Попытка ЗаписьКруговогоОсмотра.Пепельница = ?(Результат.sa.additional.ruashtray.v="g",Истина,Ложь); Исключение КонецПопытки;
					Попытка ЗаписьКруговогоОсмотра.Прикуриватель = ?(Результат.sa.additional.rucigarettlighter.v="g",Истина,Ложь); Исключение КонецПопытки;
                    Попытка ЗаписьКруговогоОсмотра.ОхранныеСистемыСБлокировкойЗапускаДвигателя = ?(Результат.sa.additional.rusecuritysystem.v="g",Истина,Ложь); Исключение КонецПопытки;
					Попытка ЗаписьКруговогоОсмотра.СекретныеГайкиНаКолесах = ?(Результат.sa.additional.rusecretnutsonwheel.v="g",Истина,Ложь); Исключение КонецПопытки;
					
					ЗаписьКруговогоОсмотра.Кузов = ?(Результат.sa.body.v="o",Истина,ДеталиНеисправности(Результат.sa.body,"Кузов",ЗаказНаряд));					
					ЗаписьКруговогоОсмотра.КлючЗаявки = СтрЗаменить(Строка(RecordSet.Fields(0).Value),Символ(160),"");
					ЗаписьКруговогоОсмотра.Сотрудник = Справочники.Сотрудники.НайтиПоКоду(RecordSet.Fields(3).Value);
					
					ЗаписьКруговогоОсмотра.Записать();
				  
	            КонецЕсли;
				УдалитьФайлы(КаталогВременныхФайлов()+RecordSet.Fields(0).Value+"_OK.txt");
				RecordSet.MoveNext();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Connection.Close();
	Connection = Неопределено;

КонецПроцедуры

Функция ПредставлениеТелефонаДляWA(ОбъектСсылка, ВидТелефона) Экспорт
	Представление = "";	
	НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписейКИ.Отбор.Объект.Значение      = ОбъектСсылка;
	НаборЗаписейКИ.Отбор.Объект.Использование = Истина;
	НаборЗаписейКИ.Отбор.Вид.Значение      = ВидТелефона;
	НаборЗаписейКИ.Отбор.Вид.Использование = Истина;
	НаборЗаписейКИ.Прочитать();
	Если НаборЗаписейКИ.Количество() > 0  Тогда
		КодГорода = НаборЗаписейКИ[0].Поле2;
		Если СтрДлина(КодГорода) = 3 Тогда
			Телефон = НаборЗаписейКИ[0].Поле3;
			Если СтрДлина(Телефон) = 7 Тогда
				Представление = "+7 (" + КодГорода + ") " + Телефон;
			Иначе
				Возврат Представление;
			КонецЕсли;
		Иначе
			Возврат Представление;
		КонецЕсли;		
	КонецЕсли;	
	Возврат Представление;
КонецФункции

Функция ПолучитьСтруктуруФИО(Знач Контрагент) Экспорт 
	
	Контрагент  =  СтрЗаменить(Сокрлп(Контрагент) , " " , Символы.ПС); 
	СтруктураФио = Новый Структура; 
	СтруктураФио.Вставить("Фамилия" , СтрПолучитьСтроку(Контрагент , 1)); 
	СтруктураФио.Вставить("Имя" , СтрПолучитьСтроку(Контрагент , 2 ));
	
	Если СтрЧислоСтрок( Контрагент ) = 3 Тогда 
		СтруктураФио.Вставить("Отчество" , СтрПолучитьСтроку( Контрагент , 3 ) ); 
	Иначе
		СтруктураФио.Вставить("Отчество", "");	
	КонецЕсли;
	
	Возврат СтруктураФио; 

	
КонецФункции

Функция ПолучитьФИОСокр(Знач Контрагент) Экспорт 
	
	СтруктураФИО = ПолучитьСтруктуруФИО(Контрагент); 
	Возврат СтруктураФИО.Фамилия + " " + Лев( СтруктураФИО.Имя , 1 )  + "."  + ?(ЗначениеЗаполнено(СтруктураФИО.Отчество) , Лев(СтруктураФИО.Отчество , 1 ) + "." , ""  );
		
КонецФункции
 
Функция ПолучитьСтруктуруНастроекWA(ТипНастройки, Объект = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Текст = "ВЫБРАТЬ
	               |	WA_Настройки.Значение
	               |ИЗ
	               |	РегистрСведений.WA_Настройки КАК WA_Настройки
	               |ГДЕ
	               |	WA_Настройки.ТипНастройки = &ТипНастройки
				   |	И WA_Настройки.Объект = &Объект";
	Если НЕ Объект = Неопределено Тогда			   
		Запрос.УстановитьПараметр("Объект", Объект);
	Иначе
		Текст = СтрЗаменить(Текст,"И WA_Настройки.Объект = &Объект","");
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипНастройки",ТипНастройки);
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если ТипНастройки = Перечисления.WA_ТипыНастроек.WA_КаталогЗапчастей ИЛИ ТипНастройки = Перечисления.WA_ТипыНастроек.WA_СкладОстатков 
			ИЛИ ТипНастройки = Перечисления.WA_ТипыНастроек.WA_ПодразделениеСервиса ИЛИ ТипНастройки = Перечисления.WA_ТипыНастроек.WA_Дистрибьютор
			ИЛИ ТипНастройки = Перечисления.WA_ТипыНастроек.WA_ОрганизацияДилера ИЛИ ТипНастройки = Перечисления.WA_ТипыНастроек.WA_КаталогСлесарныхРабот Тогда
			Массив = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Массив.Добавить(Выборка.Значение);
			КонецЦикла;
			Возврат Массив;
		Иначе
			Выборка.Следующий();
			Возврат Выборка.Значение;
		КонецЕсли;

	Иначе
			Если ТипЗнч(Объект) = Тип("СправочникСсылка.ВидыРемонта") Тогда Возврат "12"
			Иначе
			Возврат Неопределено;
			КонецЕсли;
	КонецЕсли;
		
КонецФункции
